uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ГруппыСтатейБюджета</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролироватьНаправление</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/КонтрольУХКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПоказатьРасшифровкуКонтроля(Объект, СтрокаКонтроль) экспорт
	
	Контроль = Новый Структура("ВидКонтроля, АдресРезультата, ТребуетсяПроверка, Результат, РезультатСтрока, ВремяПроверки");
	Контроль.Вставить("Документ", Объект.Ссылка);
	
	ЗаполнитьЗначенияСвойств(Контроль, СтрокаКонтроль);
	Если Контроль.ТребуетсяПроверка = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаКонтроля = КонтрольУХВызовСервера.СформироватьРасшифровкуКонтроля(Контроль);
	ТипРасшифровки = ТипЗнч(РасшифровкаКонтроля);
	Если ТипРасшифровки = Тип("Структура") Тогда
		Если РасшифровкаКонтроля.Свойство("Действие") Тогда
			Если РасшифровкаКонтроля.Действие = "ОткрытьОтчет" Тогда
				// Выполняем действие: открыть отчет
				ОткрытьФорму(РасшифровкаКонтроля.ИмяОтчета, РасшифровкаКонтроля.ПараметрыОтчета);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипРасшифровки = Тип("ТабличныйДокумент") Тогда
		РасшифровкаКонтроля.ОтображатьСетку = Ложь;
		РасшифровкаКонтроля.ТолькоПросмотр = Истина;
		РасшифровкаКонтроля.ОтображатьЗаголовки = Ложь;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 документа %2'"), СтрокаКонтроль.ВидКонтроля, Объект.Ссылка);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ТабличныйДокумент", РасшифровкаКонтроля);
        ПараметрыОткрытия.Вставить("ТекстСообщения", ТекстСообщения);

		ОткрытьФорму("ОбщаяФорма.ФормаТабличногоДокумента", ПараметрыОткрытия, , Новый УникальныйИдентификатор);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	
Процедура ВыполнитьКонтрольДокументаОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	КонтрольУХКлиентСервер.ВыполнитьИнтерактивныйКонтроль(ПараметрыВыполненияКоманды.Форма);
КонецПроцедуры

Процедура ОбработкаКомандыОтчетПоЛимитам(Форма, Команда) Экспорт
	
	КомандыПериода = Новый Структура("КомандаСтрелкаВлево, КомандаГод, КомандаСтрелкаВправо");
	КомандыБюджета = Новый Структура("БюджетДвиженияДенежныхСредств, БюджетДоходовИРасходов");
	ПолеКомпоновкиГод = Новый ПараметрКомпоновкиДанных("Год");
	ПолеКомпоновкиБюджет = Новый ПараметрКомпоновкиДанных("ВидБюджета");             
	
	Для Каждого ЭлементНастроек Из Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда    
			Если ЭлементНастроек.Параметр = ПолеКомпоновкиГод Тогда
				Период = ЭлементНастроек;
			КонецЕсли;                                             
			Если ЭлементНастроек.Параметр = ПолеКомпоновкиБюджет Тогда
				ВидБюджета = ЭлементНастроек;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Если КомандыПериода.Свойство(Команда.Имя) Тогда     
		
		Если Команда.Имя = "КомандаСтрелкаВлево" Тогда
			Направление = -1;		
		ИначеЕсли Команда.Имя = "КомандаСтрелкаВправо" Тогда 
			Направление = 1;
		ИначеЕсли Команда.Имя = "КомандаГод" Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("РежимВыбора", 			Истина);
			ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", 	Истина);
			ПараметрыОткрытия.Вставить("Отбор", 				Новый Структура("ВидБюджета", ВидБюджета.Значение)); 
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыОтчетПоЛимитамЗавершение", 
																ЭтотОбъект,
																Новый Структура("ЭлементНастроек, Форма", Период, Форма));	
			
			ОткрытьФорму("РегистрСведений.ПараметрыЛимитирования.Форма.ФормаВыбораПериода", 
							ПараметрыОткрытия, 
							Форма,,,,
							Оповещение,
							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
							
			Возврат;
			
		Иначе
			Возврат;
			
		КонецЕсли;      
		
		ПараметрыЛимитирования = КонтрольУХВызовСервера.ПараметрыЛимитированияПериода(ВидБюджета.Значение, Период.Значение, Направление);
		Если ПараметрыЛимитирования = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		Период.Значение = ПараметрыЛимитирования.Период; 
		Форма.Элементы.КомандаГод.Заголовок = Формат(Период.Значение, "ДФ='dd.MM.yyyy ''г.'");
		
	КонецЕсли;  
	
	Если КомандыБюджета.Свойство(Команда.Имя) Тогда
		
		ВидБюджета.Значение = ПредопределенноеЗначение(СтрШаблон("ПланВидовХарактеристик.ВидыБюджетов.%1", Команда.Имя));
		
		Для Каждого КлючИЗначение Из КомандыБюджета Цикл
			Форма.Элементы[КлючИЗначение.Ключ].Пометка = Форма.Элементы[КлючИЗначение.Ключ].Имя = Команда.Имя; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаКомандыОтчетПоЛимитамСПериодом(Форма, Команда) Экспорт
	
	КомандыПериода = Новый Структура("КомандаСтрелкаВлево, КомандаГод, КомандаСтрелкаВправо");
	КомандыБюджета = Новый Структура("БюджетДвиженияДенежныхСредств, БюджетДоходовИРасходов");
	ПолеКомпоновкиГод = Новый ПараметрКомпоновкиДанных("Период");
	ПолеКомпоновкиБюджет = Новый ПараметрКомпоновкиДанных("ВидБюджета");             
	
	Для Каждого ЭлементНастроек Из Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда    
			Если ЭлементНастроек.Параметр = ПолеКомпоновкиГод Тогда
				Период = ЭлементНастроек;
			КонецЕсли;                                             
			Если ЭлементНастроек.Параметр = ПолеКомпоновкиБюджет Тогда
				ВидБюджета = ЭлементНастроек;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Если КомандыПериода.Свойство(Команда.Имя) Тогда     
		
		Если Команда.Имя = "КомандаСтрелкаВлево" Тогда
			Направление = -1;		
		ИначеЕсли Команда.Имя = "КомандаСтрелкаВправо" Тогда 
			Направление = 1;
		ИначеЕсли Команда.Имя = "КомандаГод" Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("РежимВыбора", 			Истина);
			ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", 	Истина);
			ПараметрыОткрытия.Вставить("Отбор", 				Новый Структура("ВидБюджета", ВидБюджета.Значение)); 
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыОтчетПоЛимитамЗавершениеПериод", 
																ЭтотОбъект,
																Новый Структура("ЭлементНастроек, ВидБюджета, Форма", Период, ВидБюджета, Форма));	
			
			ОткрытьФорму("РегистрСведений.ПараметрыЛимитирования.Форма.ФормаВыбораПериода", 
							ПараметрыОткрытия, 
							Форма,,,,
							Оповещение,
							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
							
			Возврат;
			
		Иначе
			Возврат;
			
		КонецЕсли;      
		
		ПараметрыЛимитирования = КонтрольУХВызовСервера.ПараметрыЛимитированияПериода(ВидБюджета.Значение, Период.Значение.ДатаНачала, Направление);
		Если ПараметрыЛимитирования = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		Период.Значение.ДатаНачала = ПараметрыЛимитирования.Период;          
		
		ПараметрыЛимитирования = КонтрольУХВызовСервера.ПараметрыЛимитированияПериода(ВидБюджета.Значение, Период.Значение.ДатаНачала, 1);   
		Если ПараметрыЛимитирования = Неопределено Тогда
			Период.Значение.ДатаОкончания = Дата('3999.12.31 23:59:59');
		Иначе
			Период.Значение.ДатаОкончания = ПараметрыЛимитирования.Период - 1;	
		КонецЕсли;
		
		Форма.Элементы.КомандаГод.Заголовок = Формат(Период.Значение.ДатаНачала, "ДФ='dd.MM.yyyy ''г.'");
		
	КонецЕсли;  
	
	Если КомандыБюджета.Свойство(Команда.Имя) Тогда
		
		ВидБюджета.Значение = ПредопределенноеЗначение(СтрШаблон("ПланВидовХарактеристик.ВидыБюджетов.%1", Команда.Имя));
		
		Для Каждого КлючИЗначение Из КомандыБюджета Цикл
			Форма.Элементы[КлючИЗначение.Ключ].Пометка = Форма.Элементы[КлючИЗначение.Ключ].Имя = Команда.Имя; 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаКомандыОтчетПоЛимитамЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда         
		Если ТипЗнч(ВыбранныйЭлемент) = Тип("Структура") Тогда   
			ДополнительныеПараметры.ЭлементНастроек.Значение = ВыбранныйЭлемент.Период;	
		Иначе
			ДополнительныеПараметры.ЭлементНастроек.Значение = ВыбранныйЭлемент.Значение;
		КонецЕсли;
		ДополнительныеПараметры.Форма.Элементы.КомандаГод.Заголовок = Формат(ДополнительныеПараметры.ЭлементНастроек.Значение, "ДФ='dd.MM.yyyy ''г.'");	
	КонецЕсли;

КонецПроцедуры  

Процедура ОбработкаКомандыОтчетПоЛимитамЗавершениеПериод(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда         
		Если ТипЗнч(ВыбранныйЭлемент) = Тип("Структура") Тогда   
			ДополнительныеПараметры.ЭлементНастроек.Значение.ДатаНачала = ВыбранныйЭлемент.Период;	
		Иначе
			ДополнительныеПараметры.ЭлементНастроек.Значение.ДатаНачала = ВыбранныйЭлемент.Значение;
		КонецЕсли;       
		
		ПараметрыЛимитирования = КонтрольУХВызовСервера.ПараметрыЛимитированияПериода(ДополнительныеПараметры.ВидБюджета.Значение, 
													ДополнительныеПараметры.ЭлементНастроек.Значение.ДатаНачала, 1);   
		Если ПараметрыЛимитирования = Неопределено Тогда
			ДополнительныеПараметры.ЭлементНастроек.Значение.ДатаОкончания = Дата('3999.12.31 23:59:59');
		Иначе
			ДополнительныеПараметры.ЭлементНастроек.Значение.ДатаОкончания = ПараметрыЛимитирования.Период - 1;	
		КонецЕсли;
		
		ДополнительныеПараметры.Форма.Элементы.КомандаГод.Заголовок = Формат(ДополнительныеПараметры.ЭлементНастроек.Значение.ДатаНачала, "ДФ='dd.MM.yyyy ''г.'");	
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьКонтрольДокументаОбработкаОповещения(Результат, ДопПараметры) Экспорт
	КонтрольУХКлиентСервер.ВыполнитьИнтерактивныйКонтроль(ДопПараметры.Форма);
КонецПроцедуры

// См. ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы.
Процедура ПослеНачалаРаботыСистемы() Экспорт  
	
	ПараметрыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если ПараметрыКлиента.Свойство("ПланированиеИКонтроль") Тогда
		
		ПараметрыЛимитированияВидовБюджетов = ПараметрыКлиента.ПланированиеИКонтроль.ПараметрыЛимитированияВидовБюджетов; 
		
		Если Не ПараметрыЛимитированияВидовБюджетов.Количество() = 0 Тогда		
			ПодключитьОбработчикОжидания("ПараметрыЛимитированияВывестиОповещениеОНеактуальности", 45, Истина); 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти   

#Область СтандартныеПодсистемы

#Область СозданиеНаОсновании

Процедура Подключаемый_ОткрытьФормуСозданияНаОсновании(Ссылка, ПараметрыВыполнения) Экспорт

	ПараметрыФормы = Новый Структура;      
	ПараметрыФормы.Вставить("Основание", Ссылка);      
	ПараметрыФормы.Вставить("ПредставлениеДокумента", ПараметрыВыполнения.ОписаниеКоманды.Представление); 
	
	ОткрытьФорму("ПланВидовХарактеристик.ВидыБюджетов.Форма.ФормаВидБюджета",
		ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти     

#Область СлужебныеПроцедурыИФункции

Процедура ПараметрыЛимитированияНеактуальны() Экспорт 
	
	ПараметрыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске(); 
	
	Если Не ПараметрыКлиента.Свойство("ПланированиеИКонтроль") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыЛимитированияВидовБюджетов = ПараметрыКлиента.ПланированиеИКонтроль.ПараметрыЛимитированияВидовБюджетов;
	
	Если ПараметрыЛимитированияВидовБюджетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидыБюджетов = СтрСоединить(ПараметрыЛимитированияВидовБюджетов, ", ");                             	
	
	Пояснение = СтрШаблон(НСтр("ru = 'Обновить периодичность лимитирования по видам: %1'"), ВидыБюджетов);
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Нарушение периодичности лимитирования'"),
		НавигационнаяСсылкаОтчетаУправлениеЛимитами(),
		Пояснение,
		БиблиотекаКартинок.Предупреждение32,
		СтатусОповещенияПользователя.Важное,
		"ПараметрыЛимитированияНеактуальны");
	
КонецПроцедуры 
	
// Возвращает навигационную ссылку для оповещений.
//
Функция НавигационнаяСсылкаОтчетаУправлениеЛимитами() 
	Возврат "e1cib/app/Отчет.УправлениеЛимитами";
КонецФункции 

#КонецОбласти
